# DBeam_SetBShutDepth

```pascal
PROCEDURE DBeam_SetBShutDepth(depth : INTEGER);
```

```python
def vs.DBeam_SetBShutDepth(depth):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|depth|INTEGER|   |

## Examples
```pascal
DBeam_SetBShutDepth(1);
```
```python
import vs

depth = 1

vs.DBeam_SetBShutDepth(depth)
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight